#+TITLE: Twitter Client
#+AUTHOR: caker



* require the twiiter-mode
#+BEGIN_SRC emacs-lisp
 (require 'twittering-mode)
#+END_SRC


* configs
#+BEGIN_SRC emacs-lisp
 (setq twittering-user-master-password t)
 (setq twittering-allow-insecure-server-cert t)
 (setq twittering-oauth-use-ssl nil)
 (setq twittering-use-ssl nil)
 (twittering-enable-unread-status-notifier)
 (setq-default twittering-icon-mode t)
 (setq twittering-initial-timeline-spec-string `(“:home@sina”
 ; “:home@douban”
 ))

#+END_SRC

#+results:
| “:home@sina” |




  
